-- MySQL dump 10.13  Distrib 5.7.19, for Linux (x86_64)
--
-- Host: localhost    Database:
-- ------------------------------------------------------
-- Server version	5.7.19

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Current Database: `cool`
--

CREATE DATABASE /*!32312 IF NOT EXISTS*/ `cool` /*!40100 DEFAULT CHARACTER SET utf8mb4 */;

USE `cool`;

--
-- Table structure for table `comments`
--

DROP TABLE IF EXISTS `comments`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `comments` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `postip` varchar(15) DEFAULT NULL,
  `postday` timestamp NULL DEFAULT NULL,
  `nickname` varchar(32) DEFAULT NULL,
  `token` varchar(32) DEFAULT NULL,
  `avater` varchar(140) DEFAULT NULL,
  `content` varchar(140) DEFAULT NULL,
  `wid` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=438 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `comments`
--

LOCK TABLES `comments` WRITE;
/*!40000 ALTER TABLE `comments` DISABLE KEYS */;
INSERT INTO `comments` VALUES (1,'14.116.133.170','2018-08-16 11:02:49','SuperUser','root','/weiboimg/super.jpg','[大舌头]',2),(2,'59.41.75.26','2018-08-16 11:09:00','SuperUser','root','/weiboimg/super.jpg','[笑cry]',2),(4,'113.109.23.251','2018-08-17 08:29:59','SuperUser','root','/weiboimg/super.jpg','？',2),(5,'113.109.20.62','2018-08-17 08:31:10','SuperUser','root','/weiboimg/super.jpg','[女孩]',3),(6,'113.109.20.62','2018-08-17 08:31:24','SuperUser','root','/weiboimg/super.jpg','？',3),(7,'113.109.20.62','2018-08-17 10:06:54','一沉百踩何日还','2.00NtAhMEt1fQABfd0aa9db0567MpQE','http://tva2.sinaimg.cn/crop.0.30.1228.1228.180/e59a5d47gw1ekec58xkegj21kw16o4qp.jpg','[调皮]',3),(8,'113.109.20.62','2018-08-17 10:59:03','little_cool','2.00_r_5KCt1fQABf50f373298uYXdEC','http://tva3.sinaimg.cn/crop.0.0.410.410.180/765d49d5jw8ekbayrh9fbj20be0beju8.jpg','[大笑]',4),(9,'113.109.23.251','2018-08-17 11:09:14','依然是我最大的','2.00rjxziCt1fQAB3aedf3ea61iIpHKC','http://tva3.sinaimg.cn/crop.0.0.664.664.180/94d8209fjw8fb35webdjlj20ig0igq44.jpg','[手枪]',4),(30,'113.66.0.198','2018-08-20 03:06:38','SuperUser','root','/weiboimg/super.jpg','这图就牛逼了[笑cry][笑cry][笑cry]',7);
/*!40000 ALTER TABLE `comments` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `drone`
--

DROP TABLE IF EXISTS `drone`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `drone` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `type` int(11) DEFAULT NULL,
  `urls` varchar(100) DEFAULT NULL,
  `likecount` int(11) DEFAULT NULL,
  `content` varchar(140) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `drone`
--

LOCK TABLES `drone` WRITE;
/*!40000 ALTER TABLE `drone` DISABLE KEYS */;
INSERT INTO `drone` VALUES (1,2,'https://720yun.com/t/373jepwaku5?scene_id=16151676',1,'北江夜景全景图'),(2,1,'https://cn-videos.dji.net/video_trans/ff97a179945c4b398ddc92a1b63205a1/1080.mp4',2,'飞来湖半景,第一次拍,明显不稳.'),(4,0,'/weiboimg/1561090552227.jpg',1,'图片测试'),(7,1,'https://cn-videos.dji.net/video_trans/3a4307061de84b93b1ca216cf76d0dbd/1080.mp4',2,'我的小学和我的村.'),(8,1,'/weiboimg/1536927516940.mp4',4,'想当年哥也是小鲜肉,虽然有点傻.'),(9,1,'https://cn-videos.dji.net/video_trans/af50e983250f449884f8dcae46ceabe6/1080.mp4',3,'搬之前飞一圈以作留念，猜猜我在那一栋。'),(10,1,'https://cn-videos.dji.net/video_trans/2229a5ec0a7344c5a7d9aaa688d3cd29/1080.mp4',3,'万胜围保利天幕，没想到最高220米还是看不到最高这栋的楼顶。');
/*!40000 ALTER TABLE `drone` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `dronecomment`
--

DROP TABLE IF EXISTS `dronecomment`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `dronecomment` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `mid` varchar(11) DEFAULT NULL,
  `token` varchar(32) DEFAULT NULL,
  `avater` varchar(140) DEFAULT NULL,
  `nickname` varchar(32) DEFAULT NULL,
  `content` varchar(140) DEFAULT NULL,
  `postip` varchar(15) DEFAULT NULL,
  `postday` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `dronecomment`
--

LOCK TABLES `dronecomment` WRITE;
/*!40000 ALTER TABLE `dronecomment` DISABLE KEYS */;
INSERT INTO `dronecomment` VALUES (1,'1','root','/weiboimg/super.jpg','SuperUser','[跳舞]','59.41.75.26','2018-08-16 00:13:31'),(2,'3','root','/weiboimg/super.jpg','SuperUser','[抱拳]','59.41.75.26','2018-08-16 11:05:58'),(3,'2','root','/weiboimg/super.jpg','SuperUser','[飞机]','59.41.75.26','2018-08-16 14:40:28'),(8,'1','root','/weiboimg/super.jpg','SuperUser','全屏打开效果更好!','59.41.75.155','2018-08-16 07:37:31'),(9,'3','root','/weiboimg/super.jpg','SuperUser','？','113.109.20.62','2018-08-17 08:30:51'),(10,'3','2.00NtAhMEt1fQABfd0aa9db0567MpQE','http://tva2.sinaimg.cn/crop.0.30.1228.1228.180/e59a5d47gw1ekec58xkegj21kw16o4qp.jpg','一沉百踩何日还','[惊恐]','113.109.20.62','2018-08-17 10:07:21'),(11,'4','2.00_r_5KCt1fQABf50f373298uYXdEC','http://tva3.sinaimg.cn/crop.0.0.410.410.180/765d49d5jw8ekbayrh9fbj20be0beju8.jpg','little_cool','[蛋糕]','113.109.23.251','2018-08-17 14:42:19'),(12,'10','root','/weiboimg/super.jpg','SuperUser','[脚印][脚印][脚印]','113.119.172.119','2019-06-15 16:10:36');
/*!40000 ALTER TABLE `dronecomment` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `generations`
--

DROP TABLE IF EXISTS `generations`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `generations` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `nickname` varchar(32) DEFAULT NULL,
  `wife` varchar(32) DEFAULT NULL,
  `gender` tinyint(4) DEFAULT NULL,
  `father` varchar(32) DEFAULT NULL,
  `sons` varchar(32) DEFAULT NULL,
  `details` varchar(1024) DEFAULT NULL,
  `generation` int(11) DEFAULT NULL,
  `birthday` varchar(32) DEFAULT NULL,
  `avater` varchar(32) DEFAULT NULL,
  `cookie` varchar(32) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=203 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `generations`
--

LOCK TABLES `generations` WRITE;
/*!40000 ALTER TABLE `generations` DISABLE KEYS */;
INSERT INTO `generations` VALUES (1,'陈国延','马氏;何氏',1,'0','2','陈氏始祖陈国延，和马氏合葬在浸潭铁炉坑，何氏葬在浸潭马级岗。',1,'','1534470914621.jpg','cokie'),(2,'陈兴','李氏',1,'1','5|6|7|3','二世祖陈兴（又名陈观叙），葬在浸潭黄田力竹兜，其妻李氏葬在石潭中所龙湾岭，生有三子，长子陈旵，次子陈昱，三子陈显.',2,'','','63a9f0ea7bb98050796b649e85481845'),(3,'陈显','周氏，胡氏',1,'2','8|9|4|10','三世祖陈显，葬在石潭蒲坑上炕口，其妻周氏生有二子，长子陈东胡，次子陈西朝，又妻胡氏葬在观音座，生有二子，长子陈南轩，次子陈北旦。',3,'','','63a9f0ea7bb98050796b649e85481845'),(4,'陈南轩','潘氏',1,'3','11','四世祖陈南轩,为陈显与胡氏的长子,葬在大岩洞心屋背桐柚墩顶向落洞，呈品字形，在中央，妻潘氏葬在元山屋，生有一子，陈君让。',4,'','','63a9f0ea7bb98050796b649e85481845'),(5,'陈旵','',1,'2','91|92','三世祖陈旵,为陈兴长子,所有情况不明.',3,'','','63a9f0ea7bb98050796b649e85481845'),(6,'陈昱','',1,'2','','三世祖陈昱,为陈兴次子,所有情况不明.',3,'','','63a9f0ea7bb98050796b649e85481845'),(7,'陈景','',1,'2','53|54|55','三世祖陈景,为陈兴三子,所有情况不明.',3,'','','63a9f0ea7bb98050796b649e85481845'),(8,'陈东胡','',1,'3','','四世祖陈东胡,为陈显与周氏的长子,所有情况不明.',4,'','','63a9f0ea7bb98050796b649e85481845'),(9,'陈西朝','',1,'3','','四世祖陈西朝,为陈显与周氏的次子,所有情况不明.',4,'','','63a9f0ea7bb98050796b649e85481845'),(10,'陈北拣','',1,'3','','四世祖陈北拣,为陈显与胡的次子,所有情况不明.',4,'','','63a9f0ea7bb98050796b649e85481845'),(11,'陈君让','冯氏',1,'4','12','五世祖陈君让，葬在石潭大岩洞心桐柚墩向上一墓，妻冯氏葬在洞心上岭秧地磅，生有一子，陈元佐。',5,'','','63a9f0ea7bb98050796b649e85481845'),(12,'陈元佐','雷氏',1,'11','13','六世祖陈元佐，和妻雷氏都葬在大岩洞心槽对岭，两墓。生有一子，陈广能。',6,'','','63a9f0ea7bb98050796b649e85481845'),(13,'陈广能','钟氏',1,'12','14','七世祖陈广能，葬在蒲坑观音座，妻钟氏与他同葬一穴，生有一子，陈裔宇。',7,'','','63a9f0ea7bb98050796b649e85481845'),(14,'陈裔宇','苏氏',1,'13','16','八世祖陈裔宇，葬在蒲坑下坑鸡罩顶，妻苏氏生有一子，陈寅琚。',8,'','','63a9f0ea7bb98050796b649e85481845'),(16,'陈寅琚','熊氏',1,'14','17','九世祖陈寅琚，葬在蒲坑水槽仔叫（壁上挂灯），妻熊氏也葬在此，共两穴，生有一子，陈兴文。',9,'','','63a9f0ea7bb98050796b649e85481845'),(17,'陈兴文','邵氏',1,'16','18','十世祖陈兴文，葬在中和冬瓜棚饭罗岗，妻邵氏葬在格水连花东坑口，生有一子陈德礼。',10,'','','63a9f0ea7bb98050796b649e85481845'),(18,'陈德礼','欧氏;冯氏',1,'17','19|93','十一世祖陈德礼，葬在中所山猪朗生鸡顶，有两妻欧氏和冯氏，欧氏葬在大岩李仔坳，冯氏葬在大岩角仔村叫（锅边挂粥勺）。',11,'','','63a9f0ea7bb98050796b649e85481845'),(19,'陈仕亨','仕亨婆太',1,'18','20','十二世祖陈仕亨，葬在蒲坑温牛洞叫（猛虎擒牛），仕亨婆太葬在温牛洞叫（猪笨兜）。',12,'','','63a9f0ea7bb98050796b649e85481845'),(20,'陈列旦','黄氏',1,'19','21','十三世祖陈列旦，妻黄氏大碗洞人，葬在上帝上。',13,'','','63a9f0ea7bb98050796b649e85481845'),(21,'陈有庄','黄氏',1,'20','22','十四世祖陈有庄，妻黄氏葬在上帝下。',14,'','','63a9f0ea7bb98050796b649e85481845'),(22,'陈阳保','黄氏',1,'21','23','十五世祖陈阳保，妻黄氏葬在崩面叫（蜜仔团皇）',15,'','','63a9f0ea7bb98050796b649e85481845'),(23,'陈镇均','欧氏',1,'22','24','十六世，陈镇均，娶妻欧氏西安木柚洞人，合葬在大岩芦笛塘（即今罗市圹）朝天烛顶坐巽向乾兼辰戌分针',16,'','','63a9f0ea7bb98050796b649e85481845'),(24,'陈海仁','成氏;欧观姐',1,'23','25|27|28|29','十七世，陈海仁，字亚尾，生于一八九零年庚寅岁， 卒于一九六三年癸卯岁，享年74岁。原配成氏娶联滘大围村人，育有一子陈登，都葬在芦笛塘五马归槽，坐卯向酉兼甲庚，续妻欧观姐，生于一九零一年辛丑岁，卒于一九八四年甲子岁，享年84岁。 蒲坑拕水冲人，育有四男三女，长子陈成气字土清，次子陈成堪，三子陈成槽字亚湾，四子陈成湛字松湛，大女陈水娇嫁蒲坑上坑蒋氏三元，次女陈水姐嫁仁化董塘欧东生，三女陈火姐嫁大洛银瓶咀李氏。欧观姐葬在下帝蜘蛛下山，座申向寅兼未丑吉度分针，一墓两向（即碑与墓两个分针）。海仁平生爱好堪舆学，以此为业，颇有口碑，其后椿楦并茂，子孙兴隆，为本地大户人家之一，甚有功绩，后裔丁财贵旺，福泽绵绵。',17,'一八九零年庚寅岁','','63a9f0ea7bb98050796b649e85481845'),(25,'陈成气字土清','邱莲',1,'24','44|45|46|47','平生以喃呒为业，其术甚精，颇具口碑。娶妻丘莲大岩桷坑村人，育有四男三女，长子陈介泽，次子陈介贤，三子陈栋文，四子陈桂池，长女陈始妹嫁格水木柚洞欧仕均，次女陈新娇嫁横江黎师河，三女陈后妹嫁铁一陈灶观。',18,'','','63a9f0ea7bb98050796b649e85481845'),(27,'陈成堪','雷塱',1,'24','32|33|35','十八世陈成堪，生于公元一九三四年甲戌岁二月十六日亥时，卒于二零一五年乙未岁七月十九日戌时，享年82岁。平生继承父业，将堪舆地理传承出神入化，其术甚精，颇具口碑。 娶妻雷塱，生于一九三五年乙亥岁十一月十九日未时，卒于二零一五年乙未岁四月十日巳时享年81岁。育有三男三女，长子陈景维字强，次子陈景叙字再和，三子陈景智字志勇，长女陈美群,生于一九六六年丙午岁二月十九日卯时，嫁雷坑西基塝潘国新，次女陈路莉，生于一九七三年癸丑岁七月十八日巳时， 嫁浸潭留良洞邓屋村邓慧荣，三女陈舍洪，生于一九七七年丁巳岁九月初三日寅时，嫁石潭三坑黄贵才。',18,'一九三四年甲戌岁二月十六日亥时','1534753038830.jpg','63a9f0ea7bb98050796b649e85481845'),(28,'陈成槽字湾','欧灶带',1,'24','69|70|73|84|85|86|87','十八世陈成槽字湾，娶妻欧灶带一九四一年辛巳岁四月二十六日，格水牛洞村人，生于       育有三男四女，长子陈伟全字继金，次子陈景洪，三次陈景灿，长女陈秋妹，嫁蒲坑江咀村雷海明，次女陈心娣嫁外地张生，三女陈金娣嫁浸潭斗村成观伙，四女陈少河嫁贵州人黄杰。',18,'','','63a9f0ea7bb98050796b649e85481845'),(29,'陈成湛','雷逢娣',1,'24','56|57|58','十八世陈成湛字松湛，生于一九四一年辛巳岁农历正月初十日巳时，自1969年3月参加教学工作至1987年退出教学 退出教学工作之后在村里开小卖部二十几年。娶妻雷逢娣，蒲坑大井村人，生于公元一九四三年癸未岁农历八月十五日酉时，育有三男四女，长子陈木清，次子陈锦明，三子陈考得，长女陈旵莲嫁蒲坑江咀雷路生，次女陈冬娣嫁车仔尾黄金星，三女陈进娣嫁建文刘德斌，四女陈雪梅嫁广州郭启贤。',18,'一九四一年辛巳岁农历正月初十日巳时','','63a9f0ea7bb98050796b649e85481845'),(32,'陈景维字强','祝伙霞',1,'27','36|37|38|39','十九世陈景维字强生于公元一九六三年癸卯岁农历闰四月月十二日亥时，娶妻祝伙霞生于公元一九六五年乙巳岁农历七月廿一日亥时，杜步镇大路坑坪村人，育有四男，长子陈运浩，次子陈俊杰，三子陈运龙，四子陈运丰。',19,'一九六三年癸卯岁农历闰四月月十二日亥时','','63a9f0ea7bb98050796b649e85481845'),(33,'陈景叙字再和','黄路带',1,'27','','十九世陈景叙字再和，生于公元一九六九年己酉岁正月二十二日卯时， 娶妻黄路带大岩大碗村人，生于一九七三年癸丑岁四月初六，育有三女一子，长子陈伟鹏，大女陈惠舒，生于一九九五年乙亥岁六月二十一日丑时， 次女陈小宇，生于一九九七年丁丑岁十月初二日子时， 三女陈晓乐，生于二零零八年戊子岁二月二十二日卯时。',19,'一九六九年己酉岁正月二十二日卯时','','63a9f0ea7bb98050796b649e85481845'),(35,'陈景智字志勇','庞诗华;欧少花',1,'27','41|42','十九世陈景智字志勇，娶妻庞诗华，育有一子陈逸,又妻欧少花生于公元一九八二年壬戌岁农历闰四月十七日卯时，蒲坑村人。育有一子一女，长女陈泳，生于二零零九年巳丑岁农历十二月廿二日卯时，次子陈铭善。',19,'1982.10.06','','63a9f0ea7bb98050796b649e85481845'),(36,'陈运浩','欧彩虹',1,'32','','二十世陈运浩生于一九八九年己巳岁农历四月初七寅时，娶妻欧彩虹蒲坑蒲星村人，生于公元一九九二年壬申岁七月初八日辰时。',20,'1989-04-07','/weiboimg/1561090552227.jpg','544a20f3c6496b971789523d7b0a1f12'),(37,'陈俊杰','',1,'32','','二十世陈俊杰生于公元一九九零年庚午岁农历十月初十酉时',20,'一九九零年庚午岁农历十月初十酉时','','63a9f0ea7bb98050796b649e85481845'),(38,'陈运龙','李天娇',1,'32','51','二十世陈运龙生于公元一九九一年辛未岁农历十二月十四日丑时，娶妻李天娇，英德黄花平升岩洛村人，生于公元一九九四年甲戌岁农历七月十五日未时',20,'一九九一年辛未岁农历十二月十四日丑时','','63a9f0ea7bb98050796b649e85481845'),(39,'陈运丰','',1,'32','','二十世陈运丰生于公元一九九三年癸酉岁农历四月二十八日卯时。',20,'一九九三年癸酉岁农历四月二十八日卯时','','63a9f0ea7bb98050796b649e85481845'),(41,'陈逸','未婚',1,'35','','',20,'2004-03-26','','e1e7e807a18057e56169295926f0c135'),(42,'陈铭善','未婚',1,'35','','',20,'2012-07-08','','e1e7e807a18057e56169295926f0c135'),(44,'陈介泽','蓝四妹',1,'25','49','育两女一男长女金花嫁中所黎路军，次女金带嫁南海小塘曾启明，男陈灿明',19,'1955年乙未岁3月3日戌时','','63a9f0ea7bb98050796b649e85481845'),(45,'陈介贤','邓爱娣',1,'25','','育有两女',19,'1959年己亥岁2月11日夘时','','63a9f0ea7bb98050796b649e85481845'),(46,'陈栋文','祝姚妹:',1,'25','88|89|90','育有两男两女，长子运阳，次子运安，长女秋英嫁东安邓介平，次女石妹',19,'1962年壬寅岁8月19日时','','63a9f0ea7bb98050796b649e85481845'),(47,'陈桂池','黎灶娇',1,'25','','育有五女一男，长女敏儿，次女伟芳，三女伟玲，四女慧敏，五女慧娟，男运福',19,'1970年庚戌岁2月21日夘时','','63a9f0ea7bb98050796b649e85481845'),(49,'陈灿明','陈玉莲',1,'44','50','育有两女一男:长女婉淇生于2003年癸未岁l2月初七卯时，次女园婉生于2005年乙酉岁4月16日酉时',20,'1982年壬戌岁2月23日戌时','','183.240.19.249'),(50,'陈传锐字致锐','',1,'49','','',21,'2010年庚寅岁4月9日午时','','183.240.19.249'),(51,'陈翰銮','',1,'38','','',21,'2018年正月十日亥时','','183.240.19.249'),(53,'陈东晓','孙氏',1,'7','','生子四人，锦，铎，钊，铭，',4,'','','183.240.19.243'),(54,'陈东陽','',1,'7','','',4,'','','183.240.19.243'),(55,'陈东叙','',1,'7','','',4,'','','183.240.19.243'),(56,'陈木清','邓木带',1,'29','59|62|63|64','十九世陈木清，娶妻邓木带大岩大坪村人，生于公元一九六六年丙午岁农历八月二十五日，育有一子三女，长女陈杏华，生于一九八八年戊辰岁九月十日，嫁清远龙塘上汉溏郑伟杰，次女陈丽华,生于一九九二年壬申岁八月七日，嫁和云新洲陈屋陈志敏。三女陈月华嫁广东肇庆市黄志海,给于大家姐陈旵连养 名字雷雪玲。子陈运通，1995年正月初十，娶妻郑红英，1993年正月十八。',19,'1969-05-17','','120.239.187.6'),(57,'陈锦明','陈引娣',1,'29','60|61|65','',19,'19731017 19740303','','120.239.187.6'),(58,'陈考得','',1,'29','66','',19,'1987.01.10','','117.136.41.35'),(59,'陈运通','郑红英',1,'56','67','二十世陈运通字梓华，生于公元一九九五年乙亥岁，乙亥岁农历正月初十巳时，娶妻郑红英，浸潭白花塱郑屋村人，生于公元一九九三年癸酉岁农历正月十八日巳时，大女陈奕霏，生于二零一六年丙申岁一月二十七日。',20,'1995.01.10','','117.136.41.35'),(60,'陈运坚','黎彩华',1,'57','68','',20,'1994.04.19','','117.136.41.35'),(61,'陈俭鹏','',1,'57','','',20,'1996.09.12','','117.136.41.35'),(62,'陈杏华','郑伟杰',0,'56','','',20,'1988.9.10','','117.136.41.35'),(63,'陈丽华','陈志敏',0,'56','','',20,'1992.08.07','','117.136.41.35'),(64,'陈月华','黄志海',0,'56','','陈月华给于大家姐陈旵连收养，名叫雷雪玲。',20,'1994.01.11','','117.136.41.35'),(65,'陈运妹','邓铭杰',0,'57','','',20,'1998.09.14','','117.136.41.35'),(66,'陈可莹','',0,'58','','',20,'2011.05.06','','117.136.41.35'),(67,'陈奕霏','',0,'59','','',21,'2016.3.5正月廿七','','117.136.41.35'),(68,'陈晓桐','',0,'60','','',21,'2016.3.15二月初七','','117.136.41.35'),(69,'陈介金','祝土带;蒋木姐',1,'28','71|72|81|82','',19,'','','120.239.187.202'),(70,'陈景雄','陈锦娣',1,'28','77|78|79|80','',19,'','','120.239.187.202'),(71,'陈桂香','邵定湘',0,'69','','',20,'','','120.239.187.202'),(72,'陈兆明','黎秋香',1,'69','','',20,'','','120.239.187.202'),(73,'陈景灿','邓玉萍',1,'28','74|75|76','',19,'','','120.239.187.202'),(74,'陈雪冰','',0,'73','','',20,'','','120.239.187.202'),(75,'陈奇文','',1,'73','','',20,'','','120.239.187.202'),(76,'陈雪婷','',1,'73','','',20,'','','120.239.187.202'),(77,'陈惠娟','王宗宝',0,'70','','王宗宝湖北省洪湖市',20,'','','120.239.187.202'),(78,'陈小云','江国安',0,'70','','江国安花都新华区',20,'','','120.239.187.202'),(79,'陈啟华','',0,'70','','',20,'','','120.239.187.202'),(80,'陈小君','',0,'70','','',20,'','','120.239.187.202'),(81,'陈伟聪','',0,'69','','',20,'','','120.239.187.202'),(82,'陈运飞','黄嘉玲',1,'69','83','',20,'19880521','','120.239.187.202'),(83,'陈佩珊','',0,'82','','',21,'20170202','','120.239.187.202'),(84,'陈秋妹','雷海明',0,'28','','',19,'','','120.239.187.202'),(85,'陈心娣','张燕军',0,'28','','',19,'','','120.239.187.202'),(86,'陈金娣','成观伙',0,'28','','',19,'','','120.239.187.202'),(87,'陈少河','黄杰',0,'28','','',19,'','','120.239.187.202'),(88,'陈运阳','',1,'46','','',20,'1990.2.5','','14.116.137.168'),(89,'陈运安','',1,'46','','',20,'1992.10.5','','14.116.137.168'),(90,'陈秋英','邓介平',0,'46','','',20,'','','14.116.137.168'),(91,'陈昊','',1,'5','','生有三子，长子世华，次子世英，三子世昌，长子移迁大石古，桷坑，坑口，银盏，深圳观兰，次子世英迁木槽，三子世昌迁坑口，田墩等',4,'','','117.136.40.148'),(92,'陈蒿','',1,'5','','生有三子，长子君政，次子君裔，三子君让。',4,'','','117.136.40.148'),(93,'陈仕祯','欧氏',1,'18','94|95|96','仕祯公葬在中所山猪朗，欧氏葬在格水黄草岗育儿列明，列基，列君',12,'','','14.152.94.166'),(94,'陈列明','吉氏',1,'93','97','',13,'','','14.152.94.164'),(95,'陈列基','吉氏',1,'93','98|99|125|126','育儿有源',13,'','','14.152.94.166'),(96,'陈列君','黄氏',1,'93','100|101|102|103','育儿有隆，有俊，有合，有就，合墓葬在蒲坑圩仔岗',13,'','','14.152.94.167'),(97,'失联','',1,'94','104','',14,'','','14.152.94.166'),(98,'陈有源','',1,'95','','',14,'','','14.152.94.166'),(99,'陈有盛','何氏',1,'95','115|116','育儿卓裕，卓林，卓杏，卓信',14,'','','14.152.94.166'),(100,'陈有隆','',1,'96','','葬在墩咀',14,'','','14.152.94.166'),(101,'陈有俊','吉氏',1,'96','152','育儿卓连，',14,'','','14.152.94.165'),(102,'陈有合','黎氏',1,'96','163','育儿卓常，卓刚，卓正，有合葬阳山县冷饭坑黎氏葬阳山县石盘水',14,'','','14.152.94.165'),(103,'陈有就','欧氏',1,'96','180','育儿卓赞，卓标，卓京，有就葬在山猪朗龙湾岭，欧氏葬在蒲坑上坑',14,'','','14.152.94.166'),(104,'失联','',1,'97','105','',15,'','','14.152.94.165'),(105,'陈斗，学坤','吉氏',1,'104','106','育儿金源',16,'','','14.152.94.165'),(106,'陈金源','黎氏',1,'105','107|111','育儿国洪，木桂，民国期间当兵失联，黎氏葬在大岗',17,'','','14.152.94.166'),(107,'陈国洪','欧氏',1,'106','108|109|110','育儿景生，土明，木权',18,'','','14.152.94.166'),(108,'陈景生','胡氏',1,'107','112|113','育儿嘉伟，伟斌',19,'1972年壬子岁10月8日寅时','','14.152.94.166'),(109,'陈土明','庞氏',1,'107','114','育儿炜俊',19,'1979年己未岁八月十三日卯时','','14.152.94.167'),(110,'陈木权','',1,'107','','',19,'1982年壬戌岁十月八日未时','','14.152.94.164'),(111,'陈木桂','',1,'106','','无嗣',18,'','','14.152.94.164'),(112,'陈嘉伟','',1,'108','','',20,'1992年壬申岁九月三十日辰时','','14.152.94.164'),(113,'陈伟斌','',1,'108','','',20,'2000年庚辰岁五月二十二日辰时','','14.152.94.164'),(114,'陈炜俊','',1,'109','','',20,'2011年辛卯岁二月十一日辰时','','14.152.94.166'),(115,'陈卓裕','吉氏',1,'99','','',15,'','','14.152.94.166'),(116,'陈卓林','黎氏',1,'99','117','育儿佐均，亚佳，煜均，猷均',15,'','','14.152.94.167'),(117,'陈佐均','甘氏',1,'116','118|121|122','育儿海辉，海球，海耀',16,'','','14.152.94.164'),(118,'陈海辉','欧氏',1,'117','119','育儿陈逢，继清，',17,'','','14.152.94.166'),(119,'陈逢','欧氏',1,'118','120','育儿景堂',18,'','','14.152.94.165'),(120,'陈景堂','邓氏',1,'119','','育儿土桂，运红，运飞',19,'','','14.152.94.164'),(121,'陈海球','梁氏',1,'117','','育儿义芳，金华',17,'','','14.152.94.166'),(122,'陈海耀','伍氏',1,'117','123','育儿清元，介标，东阳',17,'','','14.152.94.166'),(123,'陈介标','祝氏',1,'122','124','育儿木华',18,'','','14.152.94.166'),(124,'陈木华','',1,'123','','',19,'1972年壬子岁九月初十日丑时','','14.152.94.166'),(125,'陈有重','',1,'95','','',14,'','','14.152.94.164'),(126,'陈有定','',1,'95','127','育儿卓儒，卓杰，卓然，卓谦',14,'','','14.152.94.167'),(127,'陈卓谦','谭氏',1,'126','128','育儿钜均，爵均',15,'','','14.152.94.166'),(128,'陈钜均','祝氏',1,'127','129|130|135|136','育儿海镜，海帜，海春，海兴，钜均公葬在角坑口园仔岭',16,'','','14.152.94.166'),(129,'陈海镜','',1,'128','','育儿成熙',17,'','','14.152.94.167'),(130,'陈海帜','邓氏',1,'128','131|132|133|134','育儿介绍，水生，剑秋，成林',17,'','','14.152.94.166'),(131,'陈介绍','蒋氏',1,'130','','育儿文海，伙新',18,'','','14.152.94.167'),(132,'陈水生','',1,'130','','无嗣',18,'','','14.152.94.167'),(133,'陈剑秋','祝氏',1,'130','','育儿观河，观森',18,'','','14.152.94.164'),(134,'陈成林','黎氏',1,'130','','育儿文鸿',18,'1958年戊戌岁九月十一日西时','','14.152.94.166'),(135,'陈海春','氏',1,'128','','育儿介逢迁居仁化',17,'1958年戊戌岁九月十一日西时','','14.152.94.166'),(136,'陈海兴','黎氏',1,'128','','育儿建财，明深，郁文迁居周田',17,'1958年戊戌岁九月十一日西时','','14.152.94.165'),(141,'陈成喜，新喜','蒋氏',1,'140','150','育儿桂友，介荣',19,'1947年丁亥岁九月十七日卯时','','14.152.94.164'),(144,'陈成养，水养','邓氏',1,'140','147|148','育儿建锋，建华',19,'1954年甲午岁九月廿六日寅时','','14.152.94.167'),(145,'陈成海，观海','陈氏',1,'140','149','育儿锦辉',19,'1966年丙午岁九月初一日寅时','','14.152.94.164'),(147,'陈建锋，景锋','易氏',1,'144','','育儿浩轩',20,'1992年壬申岁十二月初二日丑时','','14.152.94.167'),(148,'陈建华','',1,'144','','育儿',20,'1994年甲戌岁十月十日','','14.152.94.164'),(149,'陈锦辉','',1,'145','','育儿',20,'1995年乙亥岁十一月九日未时','','14.152.94.164'),(150,'陈介荣','韦氏',1,'141','','育儿梓颖',20,'1981年辛西岁八月十四日辰时','','14.152.94.166'),(152,'陈卓连','吉氏',1,'101','153','育儿瑞均，意均，鑑均都无嗣，胤均',15,'','','183.236.31.218'),(153,'陈胤均','叶氏',1,'152','154','育儿观养，无嗣，海杰',16,'','','183.236.31.218'),(154,'陈海杰，亚福','蒋氏',1,'153','155|158|159','育儿成喜，成英(无嗣)，成养，成海',17,'','','183.236.31.218'),(155,'陈成喜，新喜','蒋氏',1,'154','156|157','育儿桂友，介荣',18,'1947年丁亥岁九月十七日卯时','','183.236.31.218'),(156,'陈桂友','谢氏',1,'155','','育儿',19,'1979年己未岁十二月初七日丑时','','183.236.31.218'),(157,'陈介荣','韦氏',1,'155','','育儿梓颖',19,'1981年辛西岁八月十四日辰时','','183.236.31.218'),(158,'陈成养，水养','邓氏',1,'154','160|161','育儿建锋，建华',18,'1954年甲午岁九月廿六日寅时','','183.236.31.218'),(159,'陈成海，观海','陈氏',1,'154','162','育儿锦辉',18,'1966年丙午岁九月初一日寅时','','183.236.31.218'),(160,'陈景锋，建锋','易氏',1,'158','','育儿浩轩',19,'1992年壬申岁十二月初二日丑时','','183.236.31.218'),(161,'陈建华','',1,'158','','育儿',19,'1994年甲戌岁十月初十日','','183.236.31.218'),(162,'陈锦辉','',1,'159','','育儿',19,'1995年乙亥岁十一月初九日未时','','183.236.31.218'),(163,'陈卓常','赖氏',1,'102','164','育儿继兴，坤兴，卓常葬在阳山县牛皮岭顶，赖氏葬在阳山县新圩',15,'1995年乙亥岁十一月初九日未时','','183.236.31.218'),(164,'陈坤兴','黄氏',1,'163','165|166','育儿朝吉，朝迪(无嗣)，朝明，坤兴公葬在黄草岗，黄氏葬在大井庙背',16,'1995年乙亥岁十一月初九日未时','','183.236.31.218'),(165,'陈朝吉，大吉','欧氏',1,'164','167|168|169|170','育儿金贺，炳财，炳南，阳芬',17,'1933年癸酉岁二月初七日巳时','','183.236.31.218'),(166,'陈朝明，海明','欧氏',1,'164','176|177|178|179','育儿德洲，活坚，柏飞，结联',17,'1938年戊寅岁八月十六日','','183.236.31.218'),(167,'陈金贺','韩氏',1,'165','171|172','育儿景新，建红',18,'1956年丙申岁八月初五日','','183.236.31.218'),(168,'陈炳财','邓氏',1,'165','173','育儿景文',18,'1963年癸卯岁六月廿八日','','183.236.31.218'),(169,'陈炳南','欧氏',1,'165','174','育儿景森',18,'1968年戊申岁十一月廿九日','','183.236.31.218'),(170,'陈阳芬','欧氏',1,'165','175','育儿文杰',18,'1973年癸丑岁六月廿六日','','183.236.31.218'),(171,'陈景新','邹氏',1,'167','','育儿志俭，家乐',19,'1973年癸丑岁九月九日','','183.236.31.218'),(172,'陈建红','欧氏',1,'167','','育儿子博',19,'1981年辛西岁八月初七日','','183.236.31.218'),(173,'陈景文','陈氏',1,'168','','育儿裔谦',19,'1985年乙丑岁十月初十日寅时','','183.236.31.218'),(174,'陈景森','陆氏',1,'169','','育儿振豪，振辉',19,'1985年乙丑岁七月廿一日','','183.236.31.218'),(175,'陈文杰','',1,'170','','育儿',19,'1995年乙亥岁十二月十三日寅时','','183.236.31.218'),(176,'陈德洲','欧氏',1,'166','','育儿智锐',18,'1965年已岁十月初十日','','183.236.31.218'),(177,'陈活坚','唐氏',1,'166','','育儿文摘',18,'1970年庚戌岁十月','','183.236.31.218'),(178,'陈柏飞','罗氏',1,'166','','育儿景炜，俊艺',18,'1973年癸丑岁七月','','183.236.31.218'),(179,'陈结联','张氏',1,'166','','育儿',18,'1977年丁巳岁二月','','183.236.31.218'),(180,'陈卓赞，东秀','梁氏',1,'103','181|184|185','育儿权均，法均，焕均',15,'1977年丁巳岁二月','','183.236.31.218'),(181,'陈田，权均，','蒋氏',1,'180','182|183','育儿金瑞，九玲',16,'1977年丁巳岁二月','','183.236.31.218'),(182,'陈金瑞，海铿','蒋氏',1,'181','','育儿陈杞',17,'1977年丁巳岁二月','','183.236.31.218'),(183,'陈九玲','雷氏',1,'181','186','育儿诗金',17,'1928年戊辰岁二月初六日亥时','','183.236.31.218'),(184,'陈法均','刘氏',1,'180','190|191','育儿二筹，亚英',16,'','','183.236.31.218'),(185,'陈焕均','黄氏',1,'180','200','育儿观带(无嗣)，郁昌',16,'','','183.236.31.218'),(186,'陈成来，诗金','邓氏',1,'183','187|188|189','育儿介文，火兴，北水',18,'1955年乙未岁二月初九日寅时','','183.236.31.218'),(187,'陈介文','成氏',1,'186','','育儿永成',19,'1973年癸丑岁十月十九日未时','','183.236.31.218'),(188,'陈火兴','唐氏',1,'186','','育儿永聪',19,'1976年丙辰岁正月廿三日申时','','183.236.31.218'),(189,'陈北水','黄氏',1,'186','','育儿越浩',19,'1981年辛西岁五月廿三日寅时','','183.236.31.218'),(190,'陈海珊，二筹','欧氏',1,'184','192|193|194','育儿成木，成伟，继平',17,'1910年庚戌岁七月十九日酉时','','183.236.31.218'),(191,'陈英','黄氏',1,'184','','育儿金水迁仁化苳圹',17,'1910年庚戌岁七月十九日酉时','','183.236.31.218'),(192,'陈成木','邓氏',1,'190','195|196|197','育儿德就，永锋，明华',18,'1953年癸已岁五月十七日丑时','','183.236.31.218'),(193,'陈成伟','温氏',1,'190','198','育儿小聪',18,'1955年乙未岁八月廿二日辰时','','183.236.31.218'),(194,'陈继平','李氏',1,'190','199','育儿家俊',18,'1959年已亥岁十月十九日丑时','','183.236.31.218'),(195,'陈德就','陈氏，祝氏',1,'192','','育儿梓能，浩然',19,'1972年壬子岁九月十二日辰时','','183.236.31.218'),(196,'陈永锋','欧氏',1,'192','','育儿仲轩',19,'1976年丙辰岁润八月十九日亥时','','183.236.31.218'),(197,'陈明华','氏',1,'192','','育儿仲轩',19,'1979年已未岁十二月初三日戌时','','183.236.31.218'),(198,'陈小聪','朱氏',1,'193','','育儿凯燊',19,'1981年辛酉岁五月十九日申时','','183.236.31.218'),(199,'陈家俊','',1,'194','','育儿',19,'1997年丁丑岁六月廿九日未时','','183.236.31.218'),(200,'陈郁昌','黎氏',1,'185','201|202','育儿观生，文权',17,'1945年乙酉岁十二月廿三日','','183.236.31.218'),(201,'陈观生','陈氏',1,'200','','育儿伟东',18,'1968年戊申岁九月初二日','','183.236.31.218'),(202,'陈文权','朱氏',1,'200','','育儿',18,'1977年丁已岁七月初八日西时','','183.236.31.218');
/*!40000 ALTER TABLE `generations` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `share`
--

DROP TABLE IF EXISTS `share`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `share` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(100) NOT NULL,
  `content` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `share`
--

LOCK TABLES `share` WRITE;
/*!40000 ALTER TABLE `share` DISABLE KEYS */;
INSERT INTO `share` VALUES (1,'office2016','office2016');
/*!40000 ALTER TABLE `share` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `third_platform`
--

DROP TABLE IF EXISTS `third_platform`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `third_platform` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(30) NOT NULL,
  `app_id` varchar(30) DEFAULT NULL,
  `app_secret` varchar(50) DEFAULT NULL,
  `redirect` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `third_platform`
--

LOCK TABLES `third_platform` WRITE;
/*!40000 ALTER TABLE `third_platform` DISABLE KEYS */;
INSERT INTO `third_platform` VALUES (1,'sina','920104979','277341fd0d068c4f2fadc2af548c3e81','http://ec2-54-213-239-168.us-west-2.compute.amazonaws.com/cool/callback.do');
/*!40000 ALTER TABLE `third_platform` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user`
--

DROP TABLE IF EXISTS `user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `user` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `token` varchar(32) DEFAULT NULL,
  `regday` timestamp NULL DEFAULT NULL,
  `regip` varchar(32) DEFAULT NULL,
  `uid` varchar(10) DEFAULT NULL,
  `nickname` varchar(32) DEFAULT NULL,
  `psd` varchar(32) DEFAULT NULL,
  `refresh_token` varchar(32) DEFAULT NULL,
  `isblock` tinyint(4) DEFAULT NULL,
  `cookie` varchar(32) DEFAULT NULL,
  `avater` varchar(140) DEFAULT NULL,
  `ismanager` tinyint(4) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=17 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user`
--

LOCK TABLES `user` WRITE;
/*!40000 ALTER TABLE `user` DISABLE KEYS */;
INSERT INTO `user` VALUES (1,'root','2018-08-07 04:51:00','127.0.0.1','0000000001','SuperUser','wqwqwq19890407','null',0,'63a9f0ea7bb98050796b649e85481845','/weiboimg/1561090552227.jpg',1),(5,'2.00NtAhMEt1fQABfd0aa9db0567MpQE','2018-08-17 10:06:46','113.109.20.62','3852098887','一沉百踩何日还','123','',0,'e6b7fc2fa5daa30dce7e361b3ac459e0','http://tva2.sinaimg.cn/crop.0.30.1228.1228.180/e59a5d47gw1ekec58xkegj21kw16o4qp.jpg',0),(8,'2.00_r_5KCt1fQABf50f373298uYXdEC','2018-08-17 10:15:21','113.109.20.62','1985825237','little_cool','123','',0,'544a20f3c6496b971789523d7b0a1f12','http://tva3.sinaimg.cn/crop.0.0.410.410.180/765d49d5jw8ekbayrh9fbj20be0beju8.jpg',0),(9,'2.00FDq_mCt1fQAB77d967a7a10y3VzC','2018-08-17 10:18:10','106.121.4.228','2546258103','猫四5656Opal','123','',0,'e66db3d28731b0622b733e2000ef5f28','http://tva2.sinaimg.cn/crop.0.0.200.200.180/97c4d0b7jw1ergm0gxvkxj205k05k74n.jpg',0),(10,'2.00rjxziCt1fQAB3aedf3ea61iIpHKC','2018-08-17 11:09:05','113.109.23.251','2497192095','依然是我最大的','123','',0,'a0b2ec4a7fe8d013afcd268063bec8b1','http://tva3.sinaimg.cn/crop.0.0.664.664.180/94d8209fjw8fb35webdjlj20ig0igq44.jpg',0),(11,'2.00CMqaPHt1fQAB8e4c1e7cfb0zyFk_','2018-08-17 14:40:08','117.136.79.51','6643355306','小勇','123','null',0,'e1e7e807a18057e56169295926f0c135','http://tvax3.sinaimg.cn/default/images/default_avatar_female_180.gif',0),(12,'2.006dL2fCt1fQAB42f3c43c3fUVtzcB','2018-08-20 02:45:03','125.123.186.100','2443145055','JIAA佳玲','123','',0,'5e9d6f4c7260e9af62a7e56609f2469c','http://tva4.sinaimg.cn/crop.0.0.200.200.180/919f6f5fjw1ergmuyfp7fj205k05kweq.jpg',0),(13,'2.00kDVxPHt1fQABe6f9edc5854ttO4C','2018-08-20 10:31:40','117.136.41.16','6648755612','西餐小王子ing','123','',0,'3eb927582fccc0c7fac99de417b8d64a','http://tvax1.sinaimg.cn/default/images/default_avatar_male_180.gif',0),(14,'2.004VBVSHt1fQABc046247457mrx8GE','2018-09-08 11:35:04','101.226.225.84','6686297829','用户6686297829','123','',0,'d7e3ab9596d0e14b695d2a996e603040','http://tvax2.sinaimg.cn/default/images/default_avatar_female_180.gif',0),(15,'2.00hu9OMDt1fQAB899092672exmkKfE','2019-02-12 23:41:34','183.236.19.67','2929162267','djgxbnpyuzmsaml','123','',0,'200ea62de131340abc219978e1c1194a','http://tvax4.sinaimg.cn/default/images/default_avatar_female_180.gif',0),(16,'roots','2019-06-20 20:28:13','127.0.0.1','111111','roots','55764c0508a7b75d6c9722d4c84729a1',NULL,0,NULL,'http://tva2.sinaimg.cn/crop.0.30.1228.1228.180/e59a5d47gw1ekec58xkegj21kw16o4qp.jpg',1);
/*!40000 ALTER TABLE `user` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `weibo`
--

DROP TABLE IF EXISTS `weibo`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `weibo` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `token` varchar(32) DEFAULT NULL,
  `postday` timestamp NULL DEFAULT NULL,
  `postip` varchar(15) DEFAULT NULL,
  `mid` varchar(10) DEFAULT NULL,
  `nickname` varchar(32) DEFAULT NULL,
  `avater` varchar(140) DEFAULT NULL,
  `content` varchar(140) DEFAULT NULL,
  `picurl` varchar(32) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=37 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `weibo`
--

LOCK TABLES `weibo` WRITE;
/*!40000 ALTER TABLE `weibo` DISABLE KEYS */;
INSERT INTO `weibo` VALUES (2,'root','2018-08-15 15:46:34','14.116.133.170','2','SuperUser','/weiboimg/super.jpg','[笑cry][笑cry][笑cry]你是属小狗的吗？?','1534347990067.jpg'),(3,'root','2018-08-16 15:58:48','59.41.75.26','1','SuperUser','/weiboimg/super.jpg','有道理。','1534435122020.jpg'),(4,'2.00FDq_mCt1fQAB77d967a7a10y3VzC','2018-08-17 10:18:49','106.121.4.228','1','猫四5656Opal','http://tva2.sinaimg.cn/crop.0.0.200.200.180/97c4d0b7jw1ergm0gxvkxj205k05k74n.jpg','hello world',''),(5,'2.00_r_5KCt1fQABf50f373298uYXdEC','2018-08-18 05:05:33','106.121.4.228','0','little_cool','http://tva3.sinaimg.cn/crop.0.0.410.410.180/765d49d5jw8ekbayrh9fbj20be0beju8.jpg','原来生活可以这么艰难。',''),(6,'root','2018-08-18 12:34:23','123.151.77.132','1','SuperUser','/weiboimg/super.jpg','天空好想下雨，我好想住你隔壁，改姓王。',''),(7,'2.006dL2fCt1fQAB42f3c43c3fUVtzcB','2018-08-20 02:48:17','125.123.186.100','32','JIAA佳玲','http://tva4.sinaimg.cn/crop.0.0.200.200.180/919f6f5fjw1ergmuyfp7fj205k05kweq.jpg','[大舌头]','1534733202934.jpg'),(9,'2.00FDq_mCt1fQAB77d967a7a10y3VzC','2018-08-20 05:15:37','113.66.0.198','1','猫四5656Opal','http://tva2.sinaimg.cn/crop.0.0.200.200.180/97c4d0b7jw1ergm0gxvkxj205k05k74n.jpg','精致。','1534742132523.jpg'),(10,'2.00FDq_mCt1fQAB77d967a7a10y3VzC','2018-08-20 05:20:24','113.66.0.198','0','猫四5656Opal','http://tva2.sinaimg.cn/crop.0.0.200.200.180/97c4d0b7jw1ergm0gxvkxj205k05k74n.jpg','不错不错。','1534742415345.jpg'),(11,'root','2018-08-21 01:56:16','59.41.75.232','0','SuperUser','/weiboimg/super.jpg','看着真爽。','1534816570988.jpg'),(12,'root','2018-08-26 10:08:48','61.144.138.140','1','SuperUser','/weiboimg/super.jpg','好车跟普通车的区别。','1535278116317.jpg'),(15,'2.00NtAhMEt1fQABfd0aa9db0567MpQE','2018-08-29 02:29:20','113.109.20.65','1','一沉百踩何日还','http://tva2.sinaimg.cn/crop.0.30.1228.1228.180/e59a5d47gw1ekec58xkegj21kw16o4qp.jpg','[笑cry][笑cry][笑cry][笑cry][笑cry][笑cry]这老婆是捡来的吧。','1535509725925.jpg'),(16,'root','2018-08-29 05:44:57','113.109.20.65','0','SuperUser','/weiboimg/super.jpg','我现在存款将近有六千万，名下还有10套房，5辆车，无贷款压力，现在还经营着一家规模中等的工厂，年纯利润大概有7、8百万。我就想问一下你们，根据我现在的情况，你们觉得我吹牛的毛病还有治吗？。',''),(17,'2.00NtAhMEt1fQABfd0aa9db0567MpQE','2018-09-01 12:41:23','61.151.178.167','0','一沉百踩何日还','http://tva2.sinaimg.cn/crop.0.30.1228.1228.180/e59a5d47gw1ekec58xkegj21kw16o4qp.jpg','太准了，这是我见过最准的星座分析。','1535805629841.jpg'),(18,'root','2018-09-05 03:33:03','113.66.1.237','0','SuperUser','/weiboimg/super.jpg','尽管这世上周围第一股力量都在阻止你生存，你也不应放弃，慢慢扎根，相信总有出头之日。渺小如它都做到了，你又怎能放弃！','1536118346077.jpg'),(19,'2.00FDq_mCt1fQAB77d967a7a10y3VzC','2018-09-11 05:04:31','218.19.112.221','0','猫四5656Opal','http://tva2.sinaimg.cn/crop.0.0.200.200.180/97c4d0b7jw1ergm0gxvkxj205k05k74n.jpg','心累，逻辑思维还是不够。','1536642258603.jpg'),(20,'root','2018-09-12 03:12:21','113.109.20.184','0','SuperUser','/weiboimg/super.jpg','有些话，不能在朋友圈说，不能在家人面前说，说了亲者痛，仇者快。目前所有事的发展都不在我计划或者预期内。或者这是计划不够周全的原因吧，这是我第一次对自己的人生感到迷茫，感觉就像面前有十条路，但是每条看着都不像是出路。',''),(21,'root','2018-09-13 14:22:26','113.109.21.45','0','SuperUser','/weiboimg/super.jpg','这弯这么急让我怎么转？','1536848524754.jpg'),(22,'root','2018-09-17 05:34:18','59.42.128.31','0','SuperUser','/weiboimg/super.jpg','一张动图说明为什么开车要系安全带。','1537162436794.jpg'),(23,'root','2018-09-17 13:54:53','113.109.20.52','0','SuperUser','/weiboimg/super.jpg','也许是年纪越来越大了，更懒得在社交平台表达自己的感觉，因为一来显得娇情，二来不是谁都想在乎你那些感受。看着身边的老人一个个的离去，那种无力感油然而生。时不时做梦会梦见爷爷奶奶，总觉得自己亏欠了他们，很多事我们都做得不够。然而一切都太迟了。',''),(24,'root','2018-09-24 16:49:08','120.84.11.48','0','SuperUser','/weiboimg/1561090552227.jpg','厉害。','/weiboimg/1561090552227.jpg'),(25,'2.00FDq_mCt1fQAB77d967a7a10y3VzC','2018-10-01 02:04:15','106.121.18.136','0','猫四5656Opal','http://tva2.sinaimg.cn/crop.0.0.200.200.180/97c4d0b7jw1ergm0gxvkxj205k05k74n.jpg','为什么这么难。',''),(27,'root','2018-10-02 05:29:07','106.121.131.232','0','SuperUser','/weiboimg/super.jpg','the whole world\'s against me.',''),(28,'root','2018-10-08 10:47:04','106.121.128.239','0','SuperUser','/weiboimg/super.jpg','[祈祷][祈祷][祈祷][祈祷]明天好消息。',''),(29,'root','2018-10-11 12:50:10','119.130.107.206','0','SuperUser','/weiboimg/super.jpg','踏实了的感觉。',''),(30,'root','2018-10-17 09:43:21','113.66.37.219','0','SuperUser','/weiboimg/super.jpg','地基打好了，接下来就应该慢慢起高楼了。',''),(31,'root','2018-10-27 06:55:31','183.48.47.13','0','SuperUser','/weiboimg/super.jpg','[祈祷][祈祷][祈祷]再来个好消息。',''),(32,'2.00hu9OMDt1fQAB899092672exmkKfE','2019-02-12 23:42:28','120.197.13.107','0','djgxbnpyuzmsaml','http://tvax4.sinaimg.cn/default/images/default_avatar_female_180.gif','[祈祷][祈祷][祈祷]好消息好消息。',''),(33,'root','2019-04-25 00:30:38','5.181.5.90','0','SuperUser','/weiboimg/super.jpg','25年前的错误一直犯到现在。',''),(34,'root','2019-05-30 07:46:30','223.104.63.65','0','SuperUser','/weiboimg/super.jpg','每到月底我的幻想症就会变得严重。',''),(35,'root','2019-05-31 09:14:58','116.21.179.34','0','SuperUser','/weiboimg/super.jpg','难难难。。。',''),(36,'root','2019-06-03 03:06:28','183.236.9.34','0','SuperUser','/weiboimg/1561090552227.jpg','I know it\'s gonna hurt but the pain is unexpected..','');
/*!40000 ALTER TABLE `weibo` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Current Database: `destiny`
--

CREATE DATABASE /*!32312 IF NOT EXISTS*/ `destiny` /*!40100 DEFAULT CHARACTER SET utf8mb4 */;

USE `destiny`;

--
-- Table structure for table `d_person`
--

DROP TABLE IF EXISTS `d_person`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `d_person` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `name` varchar(36) NOT NULL COMMENT '命造名称',
  `detail` varchar(128) DEFAULT NULL COMMENT '详细八字',
  `create_id` int(11) NOT NULL COMMENT '创建人id',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `d_person`
--

LOCK TABLES `d_person` WRITE;
/*!40000 ALTER TABLE `d_person` DISABLE KEYS */;
INSERT INTO `d_person` VALUES (7,'陈运浩','610838779534',1),(8,'陈运浩','610831800145',1),(9,'陈陈陈','610911000651',1),(10,'陈运浩','610831800335',1);
/*!40000 ALTER TABLE `d_person` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `d_user`
--

DROP TABLE IF EXISTS `d_user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `d_user` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `account` varchar(36) NOT NULL COMMENT '账号',
  `name` varchar(36) NOT NULL COMMENT '用户名称',
  `mobile` varchar(64) DEFAULT NULL COMMENT '手机号',
  `openid` varchar(255) DEFAULT NULL COMMENT '第三方登录token',
  `password` varchar(128) NOT NULL COMMENT '密码',
  `status` int(11) NOT NULL DEFAULT '1' COMMENT '状态',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `d_user`
--

LOCK TABLES `d_user` WRITE;
/*!40000 ALTER TABLE `d_user` DISABLE KEYS */;
/*!40000 ALTER TABLE `d_user` ENABLE KEYS */;
UNLOCK TABLES;
